class Buttons:
    HOUSE = "Будинок"

    ADD_COUNTER = "Додати лічильник"
    SUBMIT_READINGS = "📊 Надіслати показники"
    EDIT_PROFILE = "👤 Редагувати профіль"
    ABOUT = "🏢 Про Нас"

    FULL_NAME = "ПІБ"
    ADDRESS = "Адреса"
    APARTMENT_NUMBER = "Номер квартири"
    COUNT_OF_METERS = "Кількість лічильників"
    ACCOUNT_NUMBER = "Номер рахунку"
    BACK = "Назад"
    MAIN = "Головне меню"
    GO_HOME = "На головну"

    SHARE_PHONE = "📱 Надіслати мій номер телефону"

    EDIT_COUNTERS = "🧮 Редагувати лічильники"
    EDIT_COUNTER = "Редагувати лічильник"
    EDIT_COUNTER_NAME = "Редагувати назву лічильника"
    DELETE_COUNTER = "Видалити лічильник"

    RELOAD_BOT = "🔄 Перезавантажити бота"

    CONSENT_YES = "Так, я даю згоду ✅"
    CONSENT_NO = "Ні, я не даю згоду ❌"

    START_BOT = "🚀 СТАРТ | Розпочати роботу 🇺🇦"

class InlineButtons:
    ABOUT_DEVELOPER = "🤖 Хто створив цього бота? | Дізнайся більше! 👨‍💻💻"


class AdminButtons:
    LOGIN = "🔐 Вхід в адмін-панель"
    GENERATE_REPORT = "📊 Вивантажити звіт"
    CURRENT_MONTH = "📅 За поточний місяць"
    PREV_MONTH = "📆 За попередній місяць"
    CUSTOM_PERIOD = "🗓️ Довільний період"
    USERS_REPORT = "👥 Звіт по користувачах"
    READINGS_REPORT = "📈 Звіт по показаннях"
    SELECT_DATE_RANGE = "📅 Обрати діапазон дат"  #
    BACK = "🔙 Назад"