class Texts:
    START = "Привіт! 🇺🇦 \n\nДавай зареєструємо тебе."
    WELLCOME = "Привіт! 🇺🇦Радий тебе знову бачити! Обери пунт меню"
    ADDRESS = "Введіть свою адресу\n\nНаприклад: вул. Центральна, 1, кв 1):"
    APARTMENT = "Введіть номер квартири (якщо ти живеш у приватному будинку, напиши 'немає'):" # delete
    METERS_COUNT = "Скільки у тебе лічильників води? (Введіть число):"
    COUNTER_ALIAS = "Введіть назву для лічильника (наприклад, 'Кухня - холодна вода'):"
    REGISTRATION_COMPLETE = """Вітаємо 👋🇺🇦
    
Ви успішно зареєстровані в системі. Тепер ви можете:

- Додавати та Редагувати ваші лічильники
- Редагувати свій профіль
- Вности актуальні показники лічильників через цей Бот
     
    """
    COUNTER_ADDED = "Лічильник '{alias}' успішно додано!"
    INVALID_INPUT = "Будь ласка, використовуй кнопки або введіть коректні дані."

    ABOUT_US = """🏢 Про Чорнобаївське КП "ВУЖКГ" 🇺🇦

Ми - комунальне підприємство, яке забезпечує якісне управління житлово-комунальним господарством.

Наші контакти:
📍 Адреса: вул. Михайла Старицького, 2а
   селище Чорнобай, Золотоніський район
   Черкаська область, Україна, 19901

📧 Електронна пошта: chorn_vgkg@ukr.net

Основні напрямки діяльності:
- Централізоване водопостачання
- Централізоване водовідведення
- Поводження з твердими та рідкими побутовими відходами
- Утримання будинків
- Інші комунальні послуги

Графік роботи:
    Пн-Чт: 8:00 - 17:00
    Пт: 8:00 - 16:00
Обідня перерва: 12:00 - 13:00
    Сб-Нд: вихідний

З повагою,
Адміністрація Чорнобаївського КП "ВУЖКГ" 💧"""

    ABOUT_DEVELOPER =  """👨‍💻 Про розробника 🇺🇦

Розробник: Родоманцев Вячеслав

10 років досвіду в розробці технологічних рішень

Створюю:
- Телеграм-боти
- Веб-додатки
- Системи управління

Технології:
- Angular, Python, Telegram Bot Development and etc.

Мої переваги:
- Індивідуальний підхід до кожного проєкту
- Швидка розробка та впровадження
- Технічна підтримка 24/7
- Гарантія якості та надійності
- Адаптація під специфіку вашого бізнесу
- Економічно ефективні рішення

Перетворюю складні завдання на прості та зручні рішення. 🚀

Зв'язок:
📸 Instagram: https://tinyurl.com/2s3z6bb2\n
💼 Linkedin: https://tinyurl.com/kaeudenv\n
🌐 FaceBook: https://tinyurl.com/38bpv5wy\n
💻 Розробка ботів, сайтів та веб-додатків\n
"""



class AdminTexts:
    LOGIN_PROMPT = "Введіть адміністративний пароль:"
    WELCOME = "Вітаємо в адмін-панелі!"
    SELECT_ACTION = "Оберіть дію:"
    SELECT_REPORT_PERIOD = "Оберіть період для звіту:"
    INCORRECT_PASSWORD = "Невірний пароль. Спробуйте знову."